# Transform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveUV..::..Transform Method
CurveUV Class See Also
---
Transform this CurveUV by the given 2D affine transform if possible.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public CurveUV Transform(
	Transform2D trfUV
)
```

Visual Basic
---
```text
Public Function Transform ( _
	trfUV As Transform2D _
) As CurveUV
```

Visual C++
---
```text
public:
CurveUV^ Transform(
	Transform2D^ trfUV
)
```

# ### Parameters
trfUV
    Type: Autodesk.Revit.DB..::..Transform2D The given 2D affine transform.
# ### Return Value
If successful a transformed CurveUV, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CurveUV Class
Autodesk.Revit.DB Namespace